# KeyBasedTreeEntryError Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
KeyBasedTreeEntryError Properties
KeyBasedTreeEntryError Class See Also
---
The KeyBasedTreeEntryError type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ErrorType | Indicates which of possible types of problems with loading and/or building a KeyBasedTreeEntries that this KeyBasedTreeEntryError represents. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also
KeyBasedTreeEntryError Class
Autodesk.Revit.DB Namespace